{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 438,
      "content": "<｜end▁of▁sentence｜>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 439,
      "content": "<｜begin▁of▁sentence｜>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "(?i:'s|'t|'re|'ve|'m|'ll|'d)|[^\\r\\n\\p{L}\\p{N}]?\\p{L}+|\\p{N}| ?[^\\s\\p{L}\\p{N}]+[\\r\\n]*|\\s*[\\r\\n]+|\\s+(?!\\S)|\\s+"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": false,
        "use_regex": false
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<｜begin▁of▁sentence｜>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<｜begin▁of▁sentence｜>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<｜begin▁of▁sentence｜>",
          "type_id": 1
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<｜begin▁of▁sentence｜>": {
        "id": "<｜begin▁of▁sentence｜>",
        "ids": [
          439
        ],
        "tokens": [
          "<｜begin▁of▁sentence｜>"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": false,
    "use_regex": false
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "(": 0,
      ")": 1,
      ",": 2,
      "-": 3,
      ".": 4,
      "0": 5,
      "1": 6,
      "2": 7,
      "3": 8,
      "4": 9,
      "5": 10,
      "6": 11,
      "7": 12,
      "8": 13,
      "9": 14,
      ":": 15,
      "?": 16,
      "B": 17,
      "C": 18,
      "D": 19,
      "F": 20,
      "G": 21,
      "H": 22,
      "O": 23,
      "P": 24,
      "Q": 25,
      "R": 26,
      "T": 27,
      "W": 28,
      "Y": 29,
      "[": 30,
      "]": 31,
      "a": 32,
      "b": 33,
      "c": 34,
      "d": 35,
      "e": 36,
      "f": 37,
      "g": 38,
      "h": 39,
      "i": 40,
      "k": 41,
      "l": 42,
      "m": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "q": 47,
      "r": 48,
      "s": 49,
      "t": 50,
      "u": 51,
      "v": 52,
      "w": 53,
      "x": 54,
      "y": 55,
      "z": 56,
      "Ċ": 57,
      "Ġ": 58,
      "ĠĠ": 59,
      "in": 60,
      "Ġt": 61,
      "er": 62,
      "on": 63,
      "Ġa": 64,
      "re": 65,
      "at": 66,
      "st": 67,
      "en": 68,
      "or": 69,
      "Ġth": 70,
      "ĊĊ": 71,
      "Ġc": 72,
      "le": 73,
      "Ġs": 74,
      "it": 75,
      "an": 76,
      "ar": 77,
      "al": 78,
      "Ġthe": 79,
      "Ġp": 80,
      "ou": 81,
      "is": 82,
      "ing": 83,
      "es": 84,
      "Ġw": 85,
      "ion": 86,
      "ed": 87,
      "ic": 88,
      "Ġb": 89,
      "Ġd": 90,
      "et": 91,
      "Ġm": 92,
      "Ġo": 93,
      "ro": 94,
      "as": 95,
      "el": 96,
      "ct": 97,
      "nd": 98,
      "Ġin": 99,
      "ent": 100,
      "id": 101,
      "Ġn": 102,
      "Ġto": 103,
      "Ġre": 104,
      "--": 105,
      "Ġof": 106,
      "om": 107,
      "Ġ(": 108,
      "il": 109,
      "Ġand": 110,
      "ur": 111,
      "Ġl": 112,
      "ex": 113,
      "ch": 114,
      "ut": 115,
      "em": 116,
      "ol": 117,
      "th": 118,
      "Ġg": 119,
      "ig": 120,
      "iv": 121,
      "ce": 122,
      "Ġv": 123,
      "ĠT": 124,
      "ay": 125,
      "ot": 126,
      "us": 127,
      "ĠC": 128,
      "Ġst": 129,
      "un": 130,
      "ul": 131,
      "ue": 132,
      "ow": 133,
      "ew": 134,
      "um": 135,
      "Ġis": 136,
      "pe": 137,
      "ck": 138,
      "ist": 139,
      "----": 140,
      ".ĊĊ": 141,
      "Ġe": 142,
      "Ġbe": 143,
      "ers": 144,
      "Ġon": 145,
      "Ġcon": 146,
      "ap": 147,
      "ĠP": 148,
      "ass": 149,
      "ly": 150,
      "av": 151,
      "ir": 152,
      "ith": 153,
      "out": 154,
      "our": 155,
      "res": 156,
      "pt": 157,
      "ver": 158,
      "ĠB": 159,
      "ĠR": 160,
      "ĠF": 161,
      "and": 162,
      "Ġas": 163,
      "lass": 164,
      "Ġwith": 165,
      "iz": 166,
      "Ġal": 167,
      "Ġan": 168,
      "ri": 169,
      "Ġpro": 170,
      "ter": 171,
      "ĠW": 172,
      "Ġcom": 173,
      "art": 174,
      "ĠH": 175,
      "ack": 176,
      "est": 177,
      "ĠG": 178,
      "ill": 179,
      "ere": 180,
      "Ġnew": 181,
      "Ġex": 182,
      "ĠO": 183,
      "ld": 184,
      "Ġ[": 185,
      ":Ċ": 186,
      "Ġse": 187,
      "--------": 188,
      "ase": 189,
      "ang": 190,
      "Ġare": 191,
      "Ġint": 192,
      "ive": 193,
      "og": 194,
      "alue": 195,
      "are": 196,
      "ize": 197,
      "Ġby": 198,
      "ire": 199,
      "Ġsh": 200,
      "ption": 201,
      "ide": 202,
      "ac": 203,
      "que": 204,
      "yst": 205,
      "Ġus": 206,
      "Ġstr": 207,
      "ach": 208,
      "ystem": 209,
      "ell": 210,
      ".Ċ": 211,
      "put": 212,
      "rr": 213,
      "Ġun": 214,
      "row": 215,
      "ated": 216,
      "Ġall": 217,
      "ition": 218,
      "ia": 219,
      "ple": 220,
      "ther": 221,
      "Ġout": 222,
      "ge": 223,
      "quest": 224,
      "cri": 225,
      "ally": 226,
      "----------------": 227,
      "olor": 228,
      "eg": 229,
      "ĠY": 230,
      "ings": 231,
      "ange": 232,
      "rray": 233,
      "Ġtheir": 234,
      "Ġman": 235,
      "Ġvalue": 236,
      "gr": 237,
      "ions": 238,
      "]Ċ": 239,
      "Ġsp": 240,
      "ception": 241,
      "Ġother": 242,
      "class": 243,
      "Ġthere": 244,
      "Ġcomm": 245,
      "ise": 246,
      "ask": 247,
      "Ġgr": 248,
      "Ġlist": 249,
      "Ġonly": 250,
      "Ġback": 251,
      "Ġuser": 252,
      "ĠCon": 253,
      "irect": 254,
      "ĠWh": 255,
      "und": 256,
      "ful": 257,
      "ole": 258,
      "air": 259,
      "Ġarray": 260,
      "Ġsize": 261,
      "orld": 262,
      "uch": 263,
      "ative": 264,
      "Ġrec": 265,
      "Ġbl": 266,
      "ines": 267,
      "other": 268,
      "Ġed": 269,
      "lease": 270,
      "Ġins": 271,
      "atter": 272,
      "Ġmany": 273,
      "par": 274,
      "ider": 275,
      "rows": 276,
      "Ġeach": 277,
      "Ġsystem": 278,
      "rid": 279,
      "eger": 280,
      "Ġworld": 281,
      "Ġcolor": 282,
      "Ġsk": 283,
      "?ĊĊ": 284,
      "Ġinput": 285,
      "for": 286,
      "ape": 287,
      "Ġsol": 288,
      "Ġrep": 289,
      "iven": 290,
      "Ġdirect": 291,
      "ingle": 292,
      "Or": 293,
      "ric": 294,
      "Ġquest": 295,
      "sw": 296,
      "ĠĠĊ": 297,
      "ique": 298,
      "Ġbig": 299,
      "aces": 300,
      "Ġanother": 301,
      "Ġcare": 302,
      "ior": 303,
      "Ġnon": 304,
      "ĠBl": 305,
      "ĠOr": 306,
      "Ġprov": 307,
      "Ġoutput": 308,
      "ĠHow": 309,
      "You": 310,
      "Ġsum": 311,
      "-w": 312,
      "ĠTe": 313,
      "resent": 314,
      "bed": 315,
      "Ġbeh": 316,
      "rec": 317,
      "Ġcell": 318,
      "ze": 319,
      "ouch": 320,
      "uest": 321,
      "Ġsingle": 322,
      "Ġanal": 323,
      "attern": 324,
      "ills": 325,
      "ids": 326,
      "Ġtask": 327,
      "Ġprovide": 328,
      "color": 329,
      "Grid": 330,
      "ĠWhat": 331,
      "swer": 332,
      "fully": 333,
      "Ġblack": 334,
      "ĠRed": 335,
      "Ġge": 336,
      "ogn": 337,
      "Ġrepresent": 338,
      "Ġanswer": 339,
      "omet": 340,
      "reen": 341,
      "part": 342,
      "Ġexception": 343,
      "airs": 344,
      "Ġquestions": 345,
      "izes": 346,
      "Ġsepar": 347,
      "Ġunique": 348,
      "Bl": 349,
      "uz": 350,
      "ĠBlack": 351,
      "?Ċ": 352,
      "-n": 353,
      "ellow": 354,
      "Ġpattern": 355,
      "Please": 356,
      "gor": 357,
      "avior": 358,
      "Ġtouch": 359,
      "Ġgrid": 360,
      "Ġrecogn": 361,
      "Red": 362,
      "Ġshape": 363,
      "Te": 364,
      "Ġedge": 365,
      "gest": 366,
      "Ġrows": 367,
      "ĠCons": 368,
      "Ġskills": 369,
      "Ġinteger": 370,
      "Ġspot": 371,
      "Ġbehavior": 372,
      "Ġcells": 373,
      "Your": 374,
      "ĠGreen": 375,
      "lines": 376,
      "Ġcolors": 377,
      "Here": 378,
      "Ġanaly": 379,
      "Ġbiggest": 380,
      "ĠBlue": 381,
      "uzz": 382,
      "Ġstrings": 383,
      "apes": 384,
      "swers": 385,
      "Blue": 386,
      "Ġanswers": 387,
      "uent": 388,
      "Ġsizes": 389,
      "Ġspaces": 390,
      "Ġpatterns": 391,
      "Ġpairs": 392,
      "Ġ----------------": 393,
      "Black": 394,
      "ĠPur": 395,
      "-class": 396,
      "uzzle": 397,
      "egative": 398,
      "-----": 399,
      "Ġrepresented": 400,
      "Ġrecognize": 401,
      "ĠRole": 402,
      "Ġcarefully": 403,
      "cribed": 404,
      "Ġarrays": 405,
      "Ġseparated": 406,
      "Green": 407,
      "Quest": 408,
      "Ġshapes": 409,
      "colors": 410,
      "ĠConsider": 411,
      "ĠOrange": 412,
      "Given": 413,
      "ometric": 414,
      "Ġanalyze": 415,
      "Ġexceptional": 416,
      "Ġpuzzle": 417,
      "ĠYellow": 418,
      "Ġsolver": 419,
      "Ġcongr": 420,
      "Ġtouching": 421,
      "ognition": 422,
      "Ġcomma": 423,
      "----Ċ": 424,
      "Questions": 425,
      "urple": 426,
      "ĠPurple": 427,
      "Orange": 428,
      "-wise": 429,
      "Yellow": 430,
      "Ġgeometric": 431,
      "uchs": 432,
      "Ġgrids": 433,
      "-rec": 434,
      "-negative": 435,
      "uchsia": 436,
      "Purple": 437
    },
    "merges": [
      [
        "Ġ",
        "Ġ"
      ],
      [
        "i",
        "n"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "e",
        "r"
      ],
      [
        "o",
        "n"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "r",
        "e"
      ],
      [
        "a",
        "t"
      ],
      [
        "s",
        "t"
      ],
      [
        "e",
        "n"
      ],
      [
        "o",
        "r"
      ],
      [
        "Ġt",
        "h"
      ],
      [
        "Ċ",
        "Ċ"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "l",
        "e"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "i",
        "t"
      ],
      [
        "a",
        "n"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "l"
      ],
      [
        "Ġth",
        "e"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "o",
        "u"
      ],
      [
        "i",
        "s"
      ],
      [
        "in",
        "g"
      ],
      [
        "e",
        "s"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "i",
        "on"
      ],
      [
        "e",
        "d"
      ],
      [
        "i",
        "c"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "e",
        "t"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "r",
        "o"
      ],
      [
        "a",
        "s"
      ],
      [
        "e",
        "l"
      ],
      [
        "c",
        "t"
      ],
      [
        "n",
        "d"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "en",
        "t"
      ],
      [
        "i",
        "d"
      ],
      [
        "Ġ",
        "n"
      ],
      [
        "Ġt",
        "o"
      ],
      [
        "Ġ",
        "re"
      ],
      [
        "-",
        "-"
      ],
      [
        "Ġo",
        "f"
      ],
      [
        "o",
        "m"
      ],
      [
        "Ġ",
        "("
      ],
      [
        "i",
        "l"
      ],
      [
        "Ġa",
        "nd"
      ],
      [
        "u",
        "r"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "e",
        "x"
      ],
      [
        "c",
        "h"
      ],
      [
        "u",
        "t"
      ],
      [
        "e",
        "m"
      ],
      [
        "o",
        "l"
      ],
      [
        "t",
        "h"
      ],
      [
        "Ġ",
        "g"
      ],
      [
        "i",
        "g"
      ],
      [
        "i",
        "v"
      ],
      [
        "c",
        "e"
      ],
      [
        "Ġ",
        "v"
      ],
      [
        "Ġ",
        "T"
      ],
      [
        "a",
        "y"
      ],
      [
        "o",
        "t"
      ],
      [
        "u",
        "s"
      ],
      [
        "Ġ",
        "C"
      ],
      [
        "Ġ",
        "st"
      ],
      [
        "u",
        "n"
      ],
      [
        "u",
        "l"
      ],
      [
        "u",
        "e"
      ],
      [
        "o",
        "w"
      ],
      [
        "e",
        "w"
      ],
      [
        "u",
        "m"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "p",
        "e"
      ],
      [
        "c",
        "k"
      ],
      [
        "i",
        "st"
      ],
      [
        "--",
        "--"
      ],
      [
        ".",
        "ĊĊ"
      ],
      [
        "Ġ",
        "e"
      ],
      [
        "Ġb",
        "e"
      ],
      [
        "er",
        "s"
      ],
      [
        "Ġ",
        "on"
      ],
      [
        "Ġc",
        "on"
      ],
      [
        "a",
        "p"
      ],
      [
        "Ġ",
        "P"
      ],
      [
        "as",
        "s"
      ],
      [
        "l",
        "y"
      ],
      [
        "a",
        "v"
      ],
      [
        "i",
        "r"
      ],
      [
        "it",
        "h"
      ],
      [
        "ou",
        "t"
      ],
      [
        "ou",
        "r"
      ],
      [
        "re",
        "s"
      ],
      [
        "p",
        "t"
      ],
      [
        "v",
        "er"
      ],
      [
        "Ġ",
        "B"
      ],
      [
        "Ġ",
        "R"
      ],
      [
        "Ġ",
        "F"
      ],
      [
        "an",
        "d"
      ],
      [
        "Ġa",
        "s"
      ],
      [
        "l",
        "ass"
      ],
      [
        "Ġw",
        "ith"
      ],
      [
        "i",
        "z"
      ],
      [
        "Ġa",
        "l"
      ],
      [
        "Ġa",
        "n"
      ],
      [
        "r",
        "i"
      ],
      [
        "Ġp",
        "ro"
      ],
      [
        "t",
        "er"
      ],
      [
        "Ġ",
        "W"
      ],
      [
        "Ġc",
        "om"
      ],
      [
        "ar",
        "t"
      ],
      [
        "Ġ",
        "H"
      ],
      [
        "a",
        "ck"
      ],
      [
        "e",
        "st"
      ],
      [
        "Ġ",
        "G"
      ],
      [
        "il",
        "l"
      ],
      [
        "er",
        "e"
      ],
      [
        "Ġn",
        "ew"
      ],
      [
        "Ġ",
        "ex"
      ],
      [
        "Ġ",
        "O"
      ],
      [
        "l",
        "d"
      ],
      [
        "Ġ",
        "["
      ],
      [
        ":",
        "Ċ"
      ],
      [
        "Ġs",
        "e"
      ],
      [
        "----",
        "----"
      ],
      [
        "as",
        "e"
      ],
      [
        "an",
        "g"
      ],
      [
        "Ġa",
        "re"
      ],
      [
        "Ġin",
        "t"
      ],
      [
        "iv",
        "e"
      ],
      [
        "o",
        "g"
      ],
      [
        "al",
        "ue"
      ],
      [
        "a",
        "re"
      ],
      [
        "iz",
        "e"
      ],
      [
        "Ġb",
        "y"
      ],
      [
        "i",
        "re"
      ],
      [
        "Ġs",
        "h"
      ],
      [
        "pt",
        "ion"
      ],
      [
        "id",
        "e"
      ],
      [
        "a",
        "c"
      ],
      [
        "q",
        "ue"
      ],
      [
        "y",
        "st"
      ],
      [
        "Ġ",
        "us"
      ],
      [
        "Ġst",
        "r"
      ],
      [
        "a",
        "ch"
      ],
      [
        "yst",
        "em"
      ],
      [
        "el",
        "l"
      ],
      [
        ".",
        "Ċ"
      ],
      [
        "p",
        "ut"
      ],
      [
        "r",
        "r"
      ],
      [
        "Ġ",
        "un"
      ],
      [
        "ro",
        "w"
      ],
      [
        "at",
        "ed"
      ],
      [
        "Ġal",
        "l"
      ],
      [
        "it",
        "ion"
      ],
      [
        "i",
        "a"
      ],
      [
        "p",
        "le"
      ],
      [
        "th",
        "er"
      ],
      [
        "Ġ",
        "out"
      ],
      [
        "g",
        "e"
      ],
      [
        "que",
        "st"
      ],
      [
        "c",
        "ri"
      ],
      [
        "al",
        "ly"
      ],
      [
        "--------",
        "--------"
      ],
      [
        "ol",
        "or"
      ],
      [
        "e",
        "g"
      ],
      [
        "Ġ",
        "Y"
      ],
      [
        "ing",
        "s"
      ],
      [
        "ang",
        "e"
      ],
      [
        "rr",
        "ay"
      ],
      [
        "Ġthe",
        "ir"
      ],
      [
        "Ġm",
        "an"
      ],
      [
        "Ġv",
        "alue"
      ],
      [
        "g",
        "r"
      ],
      [
        "ion",
        "s"
      ],
      [
        "]",
        "Ċ"
      ],
      [
        "Ġs",
        "p"
      ],
      [
        "ce",
        "ption"
      ],
      [
        "Ġo",
        "ther"
      ],
      [
        "c",
        "lass"
      ],
      [
        "Ġth",
        "ere"
      ],
      [
        "Ġcom",
        "m"
      ],
      [
        "is",
        "e"
      ],
      [
        "as",
        "k"
      ],
      [
        "Ġg",
        "r"
      ],
      [
        "Ġl",
        "ist"
      ],
      [
        "Ġon",
        "ly"
      ],
      [
        "Ġb",
        "ack"
      ],
      [
        "Ġus",
        "er"
      ],
      [
        "ĠC",
        "on"
      ],
      [
        "ire",
        "ct"
      ],
      [
        "ĠW",
        "h"
      ],
      [
        "u",
        "nd"
      ],
      [
        "f",
        "ul"
      ],
      [
        "o",
        "le"
      ],
      [
        "a",
        "ir"
      ],
      [
        "Ġa",
        "rray"
      ],
      [
        "Ġs",
        "ize"
      ],
      [
        "or",
        "ld"
      ],
      [
        "u",
        "ch"
      ],
      [
        "at",
        "ive"
      ],
      [
        "Ġre",
        "c"
      ],
      [
        "Ġb",
        "l"
      ],
      [
        "in",
        "es"
      ],
      [
        "o",
        "ther"
      ],
      [
        "Ġ",
        "ed"
      ],
      [
        "le",
        "ase"
      ],
      [
        "Ġin",
        "s"
      ],
      [
        "at",
        "ter"
      ],
      [
        "Ġman",
        "y"
      ],
      [
        "p",
        "ar"
      ],
      [
        "id",
        "er"
      ],
      [
        "row",
        "s"
      ],
      [
        "Ġe",
        "ach"
      ],
      [
        "Ġs",
        "ystem"
      ],
      [
        "r",
        "id"
      ],
      [
        "eg",
        "er"
      ],
      [
        "Ġw",
        "orld"
      ],
      [
        "Ġc",
        "olor"
      ],
      [
        "Ġs",
        "k"
      ],
      [
        "?",
        "ĊĊ"
      ],
      [
        "Ġin",
        "put"
      ],
      [
        "f",
        "or"
      ],
      [
        "a",
        "pe"
      ],
      [
        "Ġs",
        "ol"
      ],
      [
        "Ġre",
        "p"
      ],
      [
        "iv",
        "en"
      ],
      [
        "Ġd",
        "irect"
      ],
      [
        "ing",
        "le"
      ],
      [
        "O",
        "r"
      ],
      [
        "r",
        "ic"
      ],
      [
        "Ġ",
        "quest"
      ],
      [
        "s",
        "w"
      ],
      [
        "ĠĠ",
        "Ċ"
      ],
      [
        "i",
        "que"
      ],
      [
        "Ġb",
        "ig"
      ],
      [
        "ac",
        "es"
      ],
      [
        "Ġan",
        "other"
      ],
      [
        "Ġc",
        "are"
      ],
      [
        "i",
        "or"
      ],
      [
        "Ġn",
        "on"
      ],
      [
        "ĠB",
        "l"
      ],
      [
        "ĠO",
        "r"
      ],
      [
        "Ġpro",
        "v"
      ],
      [
        "Ġout",
        "put"
      ],
      [
        "ĠH",
        "ow"
      ],
      [
        "Y",
        "ou"
      ],
      [
        "Ġs",
        "um"
      ],
      [
        "-",
        "w"
      ],
      [
        "ĠT",
        "e"
      ],
      [
        "res",
        "ent"
      ],
      [
        "b",
        "ed"
      ],
      [
        "Ġbe",
        "h"
      ],
      [
        "re",
        "c"
      ],
      [
        "Ġc",
        "ell"
      ],
      [
        "z",
        "e"
      ],
      [
        "ou",
        "ch"
      ],
      [
        "ue",
        "st"
      ],
      [
        "Ġs",
        "ingle"
      ],
      [
        "Ġan",
        "al"
      ],
      [
        "atter",
        "n"
      ],
      [
        "ill",
        "s"
      ],
      [
        "id",
        "s"
      ],
      [
        "Ġt",
        "ask"
      ],
      [
        "Ġprov",
        "ide"
      ],
      [
        "c",
        "olor"
      ],
      [
        "G",
        "rid"
      ],
      [
        "ĠWh",
        "at"
      ],
      [
        "sw",
        "er"
      ],
      [
        "ful",
        "ly"
      ],
      [
        "Ġbl",
        "ack"
      ],
      [
        "ĠR",
        "ed"
      ],
      [
        "Ġg",
        "e"
      ],
      [
        "og",
        "n"
      ],
      [
        "Ġrep",
        "resent"
      ],
      [
        "Ġan",
        "swer"
      ],
      [
        "om",
        "et"
      ],
      [
        "re",
        "en"
      ],
      [
        "p",
        "art"
      ],
      [
        "Ġex",
        "ception"
      ],
      [
        "air",
        "s"
      ],
      [
        "Ġquest",
        "ions"
      ],
      [
        "iz",
        "es"
      ],
      [
        "Ġse",
        "par"
      ],
      [
        "Ġun",
        "ique"
      ],
      [
        "B",
        "l"
      ],
      [
        "u",
        "z"
      ],
      [
        "ĠBl",
        "ack"
      ],
      [
        "?",
        "Ċ"
      ],
      [
        "-",
        "n"
      ],
      [
        "ell",
        "ow"
      ],
      [
        "Ġp",
        "attern"
      ],
      [
        "P",
        "lease"
      ],
      [
        "g",
        "or"
      ],
      [
        "av",
        "ior"
      ],
      [
        "Ġt",
        "ouch"
      ],
      [
        "Ġgr",
        "id"
      ],
      [
        "Ġrec",
        "ogn"
      ],
      [
        "R",
        "ed"
      ],
      [
        "Ġsh",
        "ape"
      ],
      [
        "T",
        "e"
      ],
      [
        "Ġed",
        "ge"
      ],
      [
        "g",
        "est"
      ],
      [
        "Ġ",
        "rows"
      ],
      [
        "ĠCon",
        "s"
      ],
      [
        "Ġsk",
        "ills"
      ],
      [
        "Ġint",
        "eger"
      ],
      [
        "Ġsp",
        "ot"
      ],
      [
        "Ġbeh",
        "avior"
      ],
      [
        "Ġcell",
        "s"
      ],
      [
        "Y",
        "our"
      ],
      [
        "ĠG",
        "reen"
      ],
      [
        "l",
        "ines"
      ],
      [
        "Ġcolor",
        "s"
      ],
      [
        "H",
        "ere"
      ],
      [
        "Ġanal",
        "y"
      ],
      [
        "Ġbig",
        "gest"
      ],
      [
        "ĠBl",
        "ue"
      ],
      [
        "uz",
        "z"
      ],
      [
        "Ġstr",
        "ings"
      ],
      [
        "ap",
        "es"
      ],
      [
        "sw",
        "ers"
      ],
      [
        "Bl",
        "ue"
      ],
      [
        "Ġan",
        "swers"
      ],
      [
        "u",
        "ent"
      ],
      [
        "Ġs",
        "izes"
      ],
      [
        "Ġsp",
        "aces"
      ],
      [
        "Ġpattern",
        "s"
      ],
      [
        "Ġp",
        "airs"
      ],
      [
        "Ġ",
        "----------------"
      ],
      [
        "Bl",
        "ack"
      ],
      [
        "ĠP",
        "ur"
      ],
      [
        "-",
        "class"
      ],
      [
        "uzz",
        "le"
      ],
      [
        "eg",
        "ative"
      ],
      [
        "----",
        "-"
      ],
      [
        "Ġrepresent",
        "ed"
      ],
      [
        "Ġrecogn",
        "ize"
      ],
      [
        "ĠR",
        "ole"
      ],
      [
        "Ġcare",
        "fully"
      ],
      [
        "cri",
        "bed"
      ],
      [
        "Ġarray",
        "s"
      ],
      [
        "Ġsepar",
        "ated"
      ],
      [
        "G",
        "reen"
      ],
      [
        "Q",
        "uest"
      ],
      [
        "Ġsh",
        "apes"
      ],
      [
        "color",
        "s"
      ],
      [
        "ĠCons",
        "ider"
      ],
      [
        "ĠOr",
        "ange"
      ],
      [
        "G",
        "iven"
      ],
      [
        "omet",
        "ric"
      ],
      [
        "Ġanaly",
        "ze"
      ],
      [
        "Ġexception",
        "al"
      ],
      [
        "Ġp",
        "uzzle"
      ],
      [
        "ĠY",
        "ellow"
      ],
      [
        "Ġsol",
        "ver"
      ],
      [
        "Ġcon",
        "gr"
      ],
      [
        "Ġtouch",
        "ing"
      ],
      [
        "ogn",
        "ition"
      ],
      [
        "Ġcomm",
        "a"
      ],
      [
        "----",
        "Ċ"
      ],
      [
        "Quest",
        "ions"
      ],
      [
        "ur",
        "ple"
      ],
      [
        "ĠPur",
        "ple"
      ],
      [
        "Or",
        "ange"
      ],
      [
        "-w",
        "ise"
      ],
      [
        "Y",
        "ellow"
      ],
      [
        "Ġge",
        "ometric"
      ],
      [
        "uch",
        "s"
      ],
      [
        "Ġgr",
        "ids"
      ],
      [
        "-",
        "rec"
      ],
      [
        "-n",
        "egative"
      ],
      [
        "uchs",
        "ia"
      ],
      [
        "P",
        "urple"
      ]
    ]
  }
}